// Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.
// Нужно сделать через числа, без индексов строк.

// System.Console.WriteLine("Введите трехзначное число: ");
// int number = Convert.ToInt32(Console.ReadLine());
// if ((number / 10) < 10 || (number / 10) >= 100 )
// {
//     System.Console.WriteLine("Это не трёхзначное число");

// }
// else 
// {
//     System.Console.Write("Вторая цифра = ");
//     System.Console.WriteLine((number / 10) % 10);
// }

// Задача 13: Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.



// Задача 15: Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.